// =============== Якщо змінна більше нуля - виведіть true, менше - false.
// =============== Перевірте це на варіантах  1, 0, -3.

// let num;
// // num = 1;
// num = 1;

// if (num > 0) {
//   console.log(true); // true
// } else {
//   console.log(false);
// }

// // або
// num = -3;
// console.log(num > 0 ? true : false); // false

// // або
// n = 0;
// console.log(n > 0); // false

// =============== Якщо змінна ="test" - виведіть true.
// =============== Перевірте це на варіантах  'test', "qwerty", true

// let str;
// str = "qwerty";

// switch (str) {
//   case "test":
//     console.log(true);
//     break;
//   case "qwerty":
//     console.log(false); // false
//     break;
//   case true:
//     console.log(false);
//     break;
// }

// // або
// str = "test";
// console.log((str = "test" ? true : false)); // true

// =============== Задача: Якщо змінна більше 10 -  відніміть 5,
// =============== менше - додайте 5, результат виведіть в консоль
// =============== Перевірте це на варіантах  1, 10, 13.

// let numb;
// // numb = 1;
// numb = 10;

// if (numb > 10) {
//   console.log(numb - 5);
// } else {
//   console.log(numb + 5);
// }

// // або
// numb = 13;
// console.log(numb > 10 ? numb - 5 : numb + 5);

// =============== Задача: зробіть сервіс який отримує число від 1 до 12
// =============== виведіть місяць який дорівнює числу

// let val = prompt("Введіть число від 1 до 12", 1);
// switch (val) {
//   case "1":
//     console.log(`Ви ввели число ${val} що відповідає місяцю СІЧЕНЬ`);
//     break;
//   case "2":
//     console.log(`Ви ввели число ${val} що відповідає місяцю ЛЮТИЙ`);
//     break;
//   case "3":
//     console.log(`Ви ввели число ${val} що відповідає місяцю БЕРЕЗЕНЬ`);
//     break;
//   case "4":
//     console.log(`Ви ввели число ${val} що відповідає місяцю КВІТЕНЬ`);
//     break;
//   case "5":
//     console.log(`Ви ввели число ${val} що відповідає місяцю ТРАВЕНЬ`);
//     break;
//   case "6":
//     console.log(`Ви ввели число ${val} що відповідає місяцю ЧЕРВЕНЬ`);
//     break;
//   case "7":
//     console.log(`Ви ввели число ${val} що відповідає місяцю ЛИПЕНЬ`);
//     break;
//   case "8":
//     console.log(`Ви ввели число ${val} що відповідає місяцю СЕРПЕНЬ`);
//     break;
//   case "9":
//     console.log(`Ви ввели число ${val} що відповідає місяцю ВЕРЕСЕНЬ`);
//     break;
//   case "10":
//     console.log(`Ви ввели число ${val} що відповідає місяцю ЖОВТЕНЬ`);
//     break;
//   case "11":
//     console.log(`Ви ввели число ${val} що відповідає місяцю ЛИСТОПАД`);
//     break;
//   case "12":
//     console.log(`Ви ввели число ${val} що відповідає місяцю ГРУДЕНЬ`);
//     break;
//   default:
//     console.log(
//       "Рік має тільки 12 місяців, тому введіть саме число від 1 до 12"
//     );
// }

// // або через конвертацію спочатку в число та перевіркою на введення цілого числа
// let val = prompt("Введіть число від 1 до 12", 1);
// let num = Number(val.trim()); // конвертуємо в число та обрізаємо пробіли
// // задаєм місяці у виді масиву
// const months = [
//   "СІЧЕНЬ",
//   "ЛЮТИЙ",
//   "БЕРЕЗЕНЬ",
//   "КВІТЕНЬ",
//   "ТРАВЕНЬ",
//   "ЧЕРВЕНЬ",
//   "ЛИПЕНЬ",
//   "СЕРПЕНЬ",
//   "ВЕРЕСЕНЬ",
//   "ЖОВТЕНЬ",
//   "ЛИСТОПАД",
//   "ГРУДЕНЬ",
// ];
// // Спочатку перевірка на введення цілого числа
// if (!Number.isInteger(num)) {
//   console.log("Будь ласка, введіть ціле число.");
// } else if (num >= 1 && num <= 12) {
//   console.log(`Ви ввели число ${num}, що відповідає місяцю ${months[num - 1]}`);
// } else {
//   console.log("Рік має тільки 12 місяців, тому введіть саме число від 1 до 12");
// }

// // або через створення функції та логічні оператори в поєднанні з тернарним
// function getMonth(num) {
//   const months = [
//     "СІЧЕНЬ",
//     "ЛЮТИЙ",
//     "БЕРЕЗЕНЬ",
//     "КВІТЕНЬ",
//     "ТРАВЕНЬ",
//     "ЧЕРВЕНЬ",
//     "ЛИПЕНЬ",
//     "СЕРПЕНЬ",
//     "ВЕРЕСЕНЬ",
//     "ЖОВТЕНЬ",
//     "ЛИСТОПАД",
//     "ГРУДЕНЬ",
//   ];
//   return months[num - 1];
// }
// let val = Number(prompt("Введіть число від 1 до 12", 1));
// console.log(
//   val >= 1 && val <= 12
//     ? `Ви ввели число ${val}, що відповідає місяцю ${getMonth(val)}`
//     : "Рік має тільки 12 місяців, тому введіть саме число від 1 до 12"
// );

// =============== Задача: Зробіть сервіс який отримує тризначне число.
// =============== Поверніть користувачу сумму цих чисел.

// варіант через перевірку введеного значення на довжину та нечисло
// потім конвертацію в число і додавання "в ручну" всіх цифр
// let val = prompt("Введіть трьохзначне число", 101);
// if (val.length !== 3 || isNaN(val)) {
//   console.log("Ви не ввели трохзначне ціле число правильно, спробуйте ще раз");
// } else {
//   let dig1 = Number(val.charAt(0));
// //  можна і так: let dig1 = Number(val.at(0)); aбо let dig1 = Number(val[0]);
//   let dig2 = Number(val.charAt(1));
//   let dig3 = Number(val.charAt(2));
//   let sum = dig1 + dig2 + dig3;
//   console.log(`Сума усіх цифр введеного Вами числа ${val} складає ${sum}`);
// }

// через перевірку введеного значення на довжину та нечисло потім
// проходженням в циклі по значенням з конвертацією в число і додавання всіх цифр
// let val = prompt("Введіть трьохзначне число", 101);
// if (val.length !== 3 || isNaN(val)) {
//   console.log("Ви не ввели трохзначне ціле число правильно, спробуйте ще раз");
// } else {
//   let sum = 0;
//   for (digit of val) {
//     sum += Number(digit);
//   }
//   console.log(`Сума усіх цифр введеного Вами числа ${val} складає ${sum}`);
// }

// Варіант із перевіркою на ціле число і потім конвертація в масив та
// використання методів split та reduce
//
// let val = prompt("Введіть трьохзначне число", 101);
// if (val.length !== 3 || isNaN(val)) {
//   console.log("Ви не ввели трьохзначне ціле число правильно, спробуйте ще раз");
// } else {
//   let sum = val.split("").reduce((acc, digit) => acc + Number(digit), 0);
//   console.log(`Сума усіх цифр введеного Вами числа ${val} складає ${sum}`);
// }

// математичний спосіб розібрати значення на цифри. Спочатку конвертуємо
// в число, зробимо перевірку на введене значення і далі за допомогою
//  математичних дій отримаємо скільки значення має сотень, десятків та одиниць.
// Математичні дії передбачають:
// Ділення (/) здійснюємо зсув коми по цифрам ліворуч,
// Модуло (%) отримуємо залишок від ділення, що береться як значення
// Math.floor видаляє десяткові дроби, залишаючи лише цілу частину.
// let val = Number(prompt("Введіть трьохзначне число", 101));
// if (!Number.isInteger(val) || val < 100 || val > 999) {
//   console.log("Ви не ввели трьохзначне ціле число правильно, спробуйте ще раз");
// } else {
//   let hundreds = Math.floor(val / 100); // 101/100=1.01; Math.floor(1.01)=1 отримуємо сотні
//   let tens = Math.floor((val % 100) / 10); // 101%100=1; 1/10=0.1; Math.floor(0.1)=0 отримуємо десятки
//   let ones = val % 10; // 101%10=1 отримуємо одиниці
//   let sum = hundreds + tens + ones;

//   console.log(`Сума усіх цифр введеного Вами числа ${val} складає ${sum}`);
// }
